update readme architecture diagram
